app/controllers/actions_controller.rb

  def index
    actions = Action.all
---
SELECT `actions`.* FROM `actions` ORDER BY created_on DESC

  def create
    validate_body_params

    actions = Action.create(actions_permit)
---
INSERT INTO `actions` (`goal`, `created_on`, `deadline`, `is_completed`, `completed_on`, `created_at`, `updated_at`) VALUES ('gym', '2021-02-03 12:00:00', '2031-02-03 12:00:00', FALSE, '2022-02-03 12:00:00', '2021-11-25 15:03:03', '2021-11-25 15:03:03')

  def show
    action = Action.find(params[:id])
---
SELECT  `actions`.* FROM `actions` WHERE `actions`.`id` = 12 LIMIT 1

  def update
    validate_body_params

    action = Action.find(params[:id])
    action.update(actions_permit)
---
SELECT  `actions`.* FROM `actions` WHERE `actions`.`id` = 5 LIMIT 1
UPDATE `actions` SET `goal` = 'read', `deadline` = '2031-02-03 12:00:00', `completed_on` = '2042-02-03 12:00:00', `updated_at` = '2021-11-25 15:06:42' WHERE `actions`.`id` = 12

  def destroy
    action = Action.find(params[:id])
    action.destroy
---
SELECT  `actions`.* FROM `actions` WHERE `actions`.`id` = 1 LIMIT 1
DELETE FROM `actions` WHERE `actions`.`id` = 5